Pandas索引操作

In [18]:
import pandas as pd
obj=pd.Series([7.2,-4.3,4.5,3.6],index=['b','a','d','c'])
print(obj)
print('----------------')
#obj.reindex(['a','b','c','d','e'])
print(obj.reindex(['a','b','c','d','e']))

b    7.2
a   -4.3
d    4.5
c    3.6
dtype: float64
----------------
a   -4.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [19]:
print(obj.reindex(['a','b','c','d','e'],fill_value=0))

a   -4.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [20]:
import numpy as np
obj1=pd.Series(['blue','red','black'],index=[0,2,4])
obj1.reindex(np.arange(6),method='ffill')#该键无对应值则把前一个复制填充

0     blue
1     blue
2      red
3      red
4    black
5    black
dtype: object

In [21]:
obj2=pd.Series(['blue','red','black'],index=[0,2,4])
obj2.reindex(np.arange(6),method='backfill')#该键无对应值则把后一个复制填充

0     blue
1      red
2      red
3    black
4    black
5      NaN
dtype: object

In [22]:
df4=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['ones','two','four'])
print(df4)

   ones  two  four
a     0    1     2
c     3    4     5
d     6    7     8

In [9]:
df4.reindex(index=['a','b','c','d'],columns=['ones','two','three','four'])

   ones  two  three  four
a   0.0  1.0    NaN   2.0
b   NaN  NaN    NaN   NaN
c   3.0  4.0    NaN   5.0
d   6.0  7.0    NaN   8.0

In [10]:
df4.reindex(index=['a','b','c','d'],columns=['ones','two','three','four'],fill_value=100)

   ones  two  three  four
a     0    1    100     2
b   100  100    100   100
c     3    4    100     5
d     6    7    100     8

In [11]:
data={
    'name':['张三','李四','王五','小明'],
    'sex':['female','female','male','male'],
    'year':[2001,2001,2003,2002],
    'city':['北京','上海','广州','北京']
}
df=pd.DataFrame(data)
df1=pd.DataFrame(data,columns=['name','year','sex','city'])
df5=df1.set_index('city')
print(df5)

     name  year     sex
city
北京     张三  2001  female
上海     李四  2001  female
广州     王五  2003    male
北京     小明  2002    male

In [12]:
w1=df['name']
print('选取1列数据：\n',w1)
w2=df[['name','year']]
print('选取2列数据：\n',w2)

选取1列数据：
 0    张三
1    李四
2    王五
3    小明
Name: name, dtype: object
选取2列数据：
   name  year
0   张三  2001
1   李四  2001
2   王五  2003
3   小明  2002

In [13]:
print(df)
print('显示前2行：\n',df[:2])
print('显示2~3行：\n',df[1:3])

  name     sex  year city
0   张三  female  2001   北京
1   李四  female  2001   上海
2   王五    male  2003   广州
3   小明    male  2002   北京
显示前2行：
   name     sex  year city
0   张三  female  2001   北京
1   李四  female  2001   上海
显示2~3行：
   name     sex  year city
1   李四  female  2001   上海
2   王五    male  2003   广州

In [14]:
print(df5.loc[:,['name','year']])
print(df5.loc[['北京','上海'],['name','year']])

     name  year
city
北京     张三  2001
上海     李四  2001
广州     王五  2003
北京     小明  2002
     name  year
city
北京     张三  2001
北京     小明  2002
上海     李四  2001

In [17]:
print(df5.iloc[:,2])
print(df5.iloc[[1,3]])
print(df5.iloc[[1,3],[1,2]])

city
北京    female
上海    female
广州      male
北京      male
Name: sex, dtype: object
     name  year     sex
city
上海     李四  2001  female
北京     小明  2002    male
      year     sex
city
上海    2001  female
北京    2002    male

In [ ]:
print('显示前2行：\n',df5.ix[1:3,['name','year']])

In [23]:
df5[df5['year']==2001]

     name  year     sex
city
北京     张三  2001  female
上海     李四  2001  female

In [24]:
data1={'city':'兰州','name':'李红','year':'2005','sex':'female'}
df5.append(data1,ignore_index=True)

  name  year     sex city
0   张三  2001  female  NaN
1   李四  2001  female  NaN
2   王五  2003    male  NaN
3   小明  2002    male  NaN
4   李红  2005  female   兰州

In [25]:
df5['score']=[85,78,96,80]
df5.insert(1,'no',['001','002','003','004'])
display(df5)

     name   no  year     sex  score
city
北京     张三  001  2001  female     85
上海     李四  002  2001  female     78
广州     王五  003  2003    male     96
北京     小明  004  2002    male     80

In [28]:
print(df5.drop('广州'))

     name   no  year     sex  score
city
北京     张三  001  2001  female     85
上海     李四  002  2001  female     78
北京     小明  004  2002    male     80

In [29]:
df5.drop('sex',axis=1,inplace=True)
display(df5)

     name   no  year  score
city
北京     张三  001  2001     85
上海     李四  002  2001     78
广州     王五  003  2003     96
北京     小明  004  2002     80